use `recruit-system`;
insert into `job` (id, name, `desc`, city, salary_low, salary_high, is_done, degree, experience, hr_id)
values  (1, 'Java后端开发', '职位描述：
1.负责各类产品的开发和维护，进行软件设计和编码实现，具有良好的代码安全、代码质量、代码性能等编码意识；
2.负责并参与技术架构设计、重构、优化，根据业务规划及技术规划制定应用架构方案；
3.解决实际遇到的高并发,可靠性，复杂业务组合等各种技术业务问题,不断进行系统优化。
任职要求：
1、3年及以上项目开发实践经验，JAVA基础扎实，理解IO、多线程等基础框架；
2.掌握主流开发框架和技术标准，如springMVC、mybatis，springboot，dubbo，redis，MQ等；
3.具有较好数据库设计经验和SQL优化功底，熟悉mysql、db2数据库，分库、分表等数据治理方案；
4.熟悉网络通信和接口（http、https、scoket、websocket、webservice）；
5.熟练编写软件技术文档，具备良好的文档编制习惯和代码书写规范；
6.熟练掌握分布式、多线程应用程序编写。
7.具有良好的异常处理能力。
8.具有OA系统、人事系统、客服系统、运维平台等项目开发经验者优先。', '呼和浩特', 8, 11, 1, 2, 2, 4),
        (2, 'Java开发工程师', '                                                                                                职位描述：1.负责各类产品的开发和维护，进行软件设计和编码实现，具有良好的代码安全、代码质量、代码性能等编码意识；
2.负责并参与技术架构设计、重构、优化，根据业务规划及技术规划制定应用架构方案；3.解决实际遇到的高并发,可靠性，复杂业务组合等各种技术业务问题,不断进行系统优化。



                    ', '上海', 20, 30, 1, 5, 5, 4),
        (3, '共享出行高级算法专家', '岗位职责 (P6-P8)：利用机器学习算法处理是空轨迹数据、语音文本数据，提升共享出行的服务质量及平台效率。
业务范畴包括但不限于：推荐上车点、风控/反作弊算法、运营补贴算法、共享出行路线规划、路线旅行时间预测、服务管控等', '北京', 65, 95, 1, 5, 5, 4),
        (4, '网络安全', '1. 对网络信息安全行业特点有较深的了解，熟悉常见网络攻防技术；
2. 负责协调攻防演习、渗透测试、等级保护测评、网络安全风险评估、安全运维应急响应等工作的实施与质量把控，报告编写；
3. 负责项目小组成员管理，确保用户现场实施工作的顺利开展；
4.具备良好的表达能力，能够完整、准确的阐述技术方案；
5.较强的理解能力、文档编写能力、自学能力。工作内容负责项目售前和支持工作；
6. 积极沟通、协调整合公司内外资源，推进项目进度；
7. 负责项目交付验收，完成项目资料、验收交付文档的收集和整理。', '北京', 12, 17, 1, 5, 4, 4),
        (5, 'PCB维修', '1.2年以上电子产品维修经验；
2.能够熟练的使用热风枪，烙铁，示波器，万用表等维修工具及测量工具；
3.负责PCBA产品的维修，填写维修报表并对异常原因进行分析解决；
4.能看懂电路图，并通过电路原理检查分析PCBA异常情况并行进处理；
5.工作态度端正,为人务实,思路清晰，有一定的沟通表达能力，能够吃苦耐', '上海', 8, 12, 1, 4, 4, 4),
        (6, '项目总监/项目管理专家', '职位描述：
1. 职位的职级T8/T9。7年以上 软件/互联网/IT行业 工作经验，5年以上项目总监/项目管理专家/高级项目经理 或同职责岗位任职经历。
2. 全日制大学本科及以上学历，211/985院校优先，计算机软件等相关专业优先。
3. 具有在正规项目管理体系下独立行使项目经理的职责并完成预定目标的工作经历。
4. 具有卓越的项目计划、组织、领导、控制能力，能够通过出色的项目管理来达成预定的项目目标，确保各方满意。
5. 具备复杂项目/项目集 的管理经验，能够良好的协调跨BG/BU间的协作。
6. 对互联网/电商类业务及相关技术具有浓厚兴趣及钻研精神。
7. 了解互联网/电商基本业务架构、具备数据类项目/项目集 交付经验者优先，具有敏捷实践经验者优先。
8. 具有软件开发，尤其是互联网相关应用开发经验者优先。
9. 具有PMP、ACP、SCRUM、PRINCE2、PgMP、MSP等项目管理认证优先；', '北京', 40, 60, 1, 5, 6, 3),
        (7, '前端开发工程师', '职位基本要求：
1、本科学历，计算机相关专业，一年以上Web前端开发经验，具有项目实际开发经验, 扎实的前端基础知识：HTML，CSS，JavaScrip.
2、熟练掌握流行框架Vue、React、微信小程序。 (Vue必备)
3、了解 jquery/vue/react 等常用前端类库／框架的设计原理。 (Vue必备)
4、熟悉Node.js技术及生态，熟练使用npm/webpack/gulp等工具链。
5、熟悉git/git-lab, 熟悉Linux平台, 有前端性能优化经验.
6、有良好的学习能力和良好的团队沟通协作能力，为人正直，责任心强。
7、能够在一定压力下工作，在工作中不断提升，以适应公司的发展要求。', '上海', 12, 24, 1, 5, 5, 3),
        (8, '渗透测试工程师', '工作内容：
1. 审计公司各产品代码（JAVA、PHP），挖掘漏洞并提供修复建议
2. 对公司内部系统进行渗透测试
3. 对公司、客户的安全事件应急响应、溯源
加分项：
1. 在泛微SRC平台提交过高危漏洞
2. 对RASP、IAST技术有深入了解
3. 有CodeQL等SAST工具的使用经验
4. 有JAVA或PHP代码审计经验
5. 有应急响应经验', '上海', 15, 30, 1, 5, 4, 3),
        (9, '华为云运维工程师', '【岗位职责】
1. 负责华为云数据库相关服务的现网运维工作，运维效率提升方案或相关工具的设计和开发工作。
2. 负责华为云数据库网上问题处理，保障现网平稳运行。
【技能要求】
1. 有主流数据库(MySQL、PostgreSQL、Oracle等任意一种)的使用经验。
2. 熟练使用Linuxt操作系统，具备系统运维能力，能够使用Shel、Python等任意一种脚本语言。
3. 有强烈的责任心和使命感，具备良好的沟通能力和团队合作意识。', '西安', 12, 24, 1, 5, 4, 3),
        (10, '云运维工程师', '职位描述
职责描述：
岗位职责
1．负责云系统环境运维与搭建；
2．负责跟踪云平台主机资源使用情况；
3．负责云主机系统定期巡检；
4．负责Windows，Linux服务器操作系统的安全加固运维，应用防护等；
5. 负责云主机的数据备份；', '青岛', 6, 11, 1, 0, 0, 3),
        (11, '数据分析师', '岗位职责：
1、负责搜集客户所需最新信息并跟踪和调研，进行结果汇总；
2、组织或参与业务所需相关资料搜集、数据整理、知识共享；
3、负责开展和组织与数据相关的行业研究，报告的撰写和更新；
4、就数据所涉及业务，负责与客户进行沟通和协调，正确、清晰、全面的了解客户需求并进行深入分析；
5、配合其他部门进行的数据处理、查询，统计和分析工作。', '合肥', 5, 7, 1, 5, 4, 2),
        (12, '数据分析师', '职位描述：
1. 建立完整科学的业务指标监控；通过主动的数据分析，建立统计模型来帮助业务挖掘增长提升机会，并具备体系化和产品化的能力；
2. 和产品技术团队共同发现、孵化算法/产品类项目，并参与项目的共同推进；
3. 非常强的跨团队合作能力和沟通能力;', '上海', 20, 40, 1, 5, 6, 2),
        (13, '算法工程师（地图方向）', '职责描述：
1. 负责自主泊车高精度地图自动化在线构建算法的研发，解决构建过程中的闭环检测、精度优化以及地图连通等问题
2. 根据自主泊车的需求，开发高精度地图应用相关的引擎和接口
3. 跟踪国内外最新的研究成果，并能实现应用于实际项目中。', '上海', 20, 40, 1, 5, 4, 2),
        (14, 'NLP算法工程师', '岗位职责：
1. 负责自然语言处理相关算法的实现；
2.  负责对NLP相关的任务出算法方案以及算法调优；
3. 参与相关学术工作。', '北京', 15, 30, 1, 5, 5, 2),
        (15, '项目经理/主管', '职位描述
负责项目资源的协调与组织，确保项目团队各干系人协同工作', '深圳', 10, 11, 1, 5, 4, 2),
        (16, 'Java Developer', 'Responsibilities:
Implementation of complex software solutions for test and measurement data management on the basis of Java, J2EE, Swing, RPC, Oracle, Windows,
Familiar with Java, HTML CSS Java script, JQuery,
Familiar with datebase oracle/postgres/mssql
Good working attituade', '成都', 8, 11, 1, 0, 0, 1),
        (17, 'Java leader', '职位描述
1 、参与需求分析以及需求实现的讨论与工作量评估，制定合理的工作计划，并能在执行过程中管理风险；
2 、结合需求设计高扩展性、高性能、安全、稳定、可靠的技术系统，并持续改进；
3 、参与软件开发技术和规范及标准流程的改进；
4 、指导研发工程师的产品开发和技术研究工作，解决各类技术疑难问题，形成良好的研发氛围，提升团队 整体技术水平。', '上海', 35, 45, 1, 5, 6, 1),
        (18, 'Java SE', '职位描述
1 、参与需求分析以及需求实现的讨论与工作量评估，制定合理的工作计划，并能在执行过程中管理风险；
2 、结合需求设计高扩展性、高性能、安全、稳定、可靠的技术系统，并持续改进；
3 、参与软件开发技术和规范及标准流程的改进；
4 、指导研发工程师的产品开发和技术研究工作，解决各类技术疑难问题，形成良好的研发氛围，提升团队 整体技术水平。', '大连', 15, 20, 1, 5, 4, 1),
        (19, 'SQL Java', '职位要求：
1.2年以上Java开发工作经验
2.精通mysql、oracle或sql server等主流数据库的开发；
3.良好的沟通能力和团队合作精神，能够承受一定的工作压力 ;
4.思路清晰，逻辑分析能力强
5.有MES系统开发维护经验者优先
6.能简单的英语/日语沟通', '深圳', 7, 9, 1, 0, 4, 1),
        (20, '资深Java', '职位描述
精通 Java，熟悉其生态系统，精通关系数据库、SOL 和 ORM 技术(MyBatis、 Hibernate)，Spring 框架经验(SpringMVC、SpringBoot、SpringCloud)
<对面向对象编程有扎实的理解，使用通用设计模式的面向对象分析和设计有微服务设计和实现经验者优先
有Redis、ElasticSearch、Kafka经验者优先', '上海', 12, 22, 1, 4, 6, 1);


insert into `hr` (id, username, password, name, gender, company, telephone, email)
values  (1, 'hr', '12345', '王小刚', 0, '字节跳动', '10086', 'hr@bytedance.com'),
        (2, 'hr2', '12345', '李小萌', 1, '美团', '10010', 'hr@meituan.com'),
        (3, 'hr3', '12345', '冯大唐', 0, '饿了么', '10099', 'hr@element.com'),
        (4, 'hr4', '12345', '刘大娘', 1, '农大食堂', '16666', 'hr@imau.edu.cn');

insert into `person` (id, username, password, name, gender, school, degree, telephone, email)
values  (1, 'person1', '12345', '张三', 0, '清华大学', 2, '10086', 'p1@imau.edu.cn'),
        (2, 'person2', '12345', '李四', 1, '北京大学', 3, '10010', 'p2@imau.edu.cn'),
        (3, 'person3', '12345', '王五', 0, '复旦大学', 4, '10099', 'p3@imau.edu.cn');